Repository: capsule-native/capsule
Catalog: Sources/CapsuleAutomation/Resources/Localizable.xcstrings
Source language: en
Languages: es, fr, ja, tr, zh_hans

source: Absolute path inside the container.
es: Ruta absoluta dentro del contenedor.
fr: Chemin absolu à l'intérieur du conteneur.
ja: コンテナ内の絶対パス。
tr: Konteyner içindeki mutlak yol.
zh_hans: 容器内的绝对路径。

source: An optional name for the new container.
es: Un nombre opcional para el nuevo contenedor.
fr: Un nom facultatif pour le nouveau conteneur.
ja: 新しいコンテナの任意の名前。
tr: Yeni konteyner için isteğe bağlı bir ad.
zh_hans: 新容器的可选名称。

source: Build ${tag} from ${contextPath}
es: Compilar ${tag} desde ${contextPath}
fr: Générer ${tag} depuis ${contextPath}
ja: ${contextPath} から ${tag} をビルド
tr: ${contextPath} konumundan ${tag} derle
zh_hans: 从 ${contextPath} 构建 ${tag}

source: Build Image
es: Compilar imagen
fr: Générer une image
ja: イメージをビルド
tr: İmaj Derle
zh_hans: 构建镜像

source: Builds an image from a build-context folder.
es: Compila una imagen a partir de una carpeta de contexto de compilación.
fr: Génère une image à partir d'un dossier de contexte de build.
ja: ビルドコンテキストフォルダからイメージをビルドします。
tr: Bir derleme bağlamı klasöründen imaj derler.
zh_hans: 从构建上下文文件夹构建镜像。

source: Built %@.
es: Se compiló %@.
fr: Généré %@.
ja: %@をビルドしました。
tr: %@ derlendi.
zh_hans: 已构建 %@。

source: Capsule's automation service is not available yet.
es: El servicio de automatización de Capsule aún no está disponible.
fr: Le service d'automatisation de Capsule n'est pas encore disponible.
ja: Capsuleのオートメーションサービスはまだ利用できません。
tr: Capsule'ın otomasyon hizmeti henüz kullanılamıyor.
zh_hans: Capsule 的自动化服务尚不可用。

source: Container
es: Contenedor
fr: Conteneur
ja: コンテナ
tr: Konteyner
zh_hans: 容器

source: Containers
es: Contenedores
fr: Conteneurs
ja: コンテナ
tr: Konteynerler
zh_hans: 容器

source: Context Folder
es: Carpeta de contexto
fr: Dossier de contexte
ja: コンテキストフォルダ
tr: Bağlam Klasörü
zh_hans: 上下文文件夹

# Copied to %@:%@.
source: Copied to %1$@:%2$@.
es: Copiado a %1$@:%2$@.
fr: Copié vers %1$@:%2$@.
ja: %1$@:%2$@にコピーしました。
tr: %1$@:%2$@ konumuna kopyalandı.
zh_hans: 已复制到 %1$@:%2$@。

source: Copies a host file into a running container.
es: Copia un archivo del host a un contenedor en ejecución.
fr: Copie un fichier de l'hôte dans un conteneur en cours d'exécution.
ja: ホストのファイルを実行中のコンテナにコピーします。
tr: Bir ana bilgisayar dosyasını çalışan bir konteynere kopyalar.
zh_hans: 将主机文件复制到正在运行的容器中。

source: Copy ${sourcePath} to ${container}
es: Copiar ${sourcePath} a ${container}
fr: Copier ${sourcePath} vers ${container}
ja: ${sourcePath} を ${container} にコピー
tr: ${sourcePath} dosyasını ${container} konteynerine kopyala
zh_hans: 将 ${sourcePath} 复制到 ${container}

source: Copy File to Container
es: Copiar archivo al contenedor
fr: Copier un fichier vers le conteneur
ja: ファイルをコンテナにコピー
tr: Dosyayı Konteynere Kopyala
zh_hans: 复制文件到容器

source: Destination
es: Destino
ja: 送信先
tr: Hedef
zh_hans: 目标

source: Destination Path
es: Ruta de destino
fr: Chemin de destination
ja: コピー先パス
tr: Hedef Yol
zh_hans: 目标路径

source: Export ${container} to ${destinationPath}
es: Exportar ${container} a ${destinationPath}
fr: Exporter ${container} vers ${destinationPath}
ja: ${container} を ${destinationPath} にエクスポート
tr: ${container} konteynerini ${destinationPath} konumuna dışa aktar
zh_hans: 将 ${container} 导出到 ${destinationPath}

source: Export Container
es: Exportar contenedor
fr: Exporter le conteneur
ja: コンテナをエクスポート
tr: Konteyneri Dışa Aktar
zh_hans: 导出容器

source: Exported %@.
es: %@ exportado.
fr: %@ exporté.
ja: %@をエクスポートしました。
tr: %@ dışa aktarıldı.
zh_hans: 已导出 %@。

source: Exports a container's filesystem to a tar archive.
es: Exporta el sistema de archivos de un contenedor a un archivo tar.
fr: Exporte le système de fichiers d'un conteneur vers une archive tar.
ja: コンテナのファイルシステムをtarアーカイブにエクスポートします。
tr: Bir konteynerin dosya sistemini tar arşivine dışa aktarır.
zh_hans: 将容器的文件系统导出为 tar 归档文件。

source: Fetched logs for %@.
es: Registros obtenidos para %@.
fr: Journaux récupérés pour %@.
ja: %@のログを取得しました。
tr: %@ için günlükler alındı.
zh_hans: 已获取 %@ 的日志。

source: File
es: Archivo
fr: Fichier
ja: ファイル
tr: Dosya
zh_hans: 文件

source: Found ^[%lld container](inflect: true).
es: Se ^[encontró %lld contenedor](inflect: true).
fr: ^[%lld conteneur](inflect: true) trouvé.
ja: ^[%lld個のコンテナ](inflect: true)が見つかりました。
tr: ^[%lld konteyner](inflect: true) bulundu.
zh_hans: 找到 ^[%lld 个容器](inflect: true)。

source: Found ^[%lld image](inflect: true).
es: Se ^[encontró %lld imagen](inflect: true).
fr: ^[%lld image](inflect: true) trouvée.
ja: ^[%lld個のイメージ](inflect: true)が見つかりました。
tr: ^[%lld imaj](inflect: true) bulundu.
zh_hans: 找到 ^[%lld 个镜像](inflect: true)。

source: Get Container Logs
es: Obtener registros del contenedor
fr: Obtenir les journaux du conteneur
ja: コンテナログを取得
tr: Konteyner Günlüklerini Al
zh_hans: 获取容器日志

source: Get logs for ${container}
es: Obtener registros de ${container}
fr: Obtenir les journaux de ${container}
ja: ${container} のログを取得
tr: ${container} için günlükleri al
zh_hans: 获取 ${container} 的日志

source: Image
es: Imagen
ja: イメージ
tr: İmaj
zh_hans: 镜像

source: Images
es: Imágenes
ja: イメージ
tr: İmajlar
zh_hans: 镜像

source: Include Stopped
es: Incluir detenidos
fr: Inclure les conteneurs arrêtés
ja: 停止済みを含める
tr: Durdurulanları Dahil Et
zh_hans: 包括已停止的

source: Line Limit
es: Límite de líneas
fr: Limite de lignes
ja: 行数の上限
tr: Satır Sınırı
zh_hans: 行数限制

source: List Containers
es: Listar contenedores
fr: Lister les conteneurs
ja: コンテナ一覧を表示
tr: Konteynerleri Listele
zh_hans: 列出容器

source: List Images
es: Listar imágenes
fr: Lister les images
ja: イメージを一覧表示
tr: İmajları Listele
zh_hans: 列出镜像

source: Lists container names, optionally including stopped containers.
es: Lista los nombres de los contenedores, incluyendo opcionalmente los detenidos.
fr: Liste les noms des conteneurs, en incluant éventuellement les conteneurs arrêtés.
ja: コンテナ名を一覧表示します。停止済みコンテナを含めることもできます。
tr: Konteyner adlarını listeler, isteğe bağlı olarak durdurulan konteynerleri de içerir.
zh_hans: 列出容器名称，可选择包括已停止的容器。

source: Lists the references of local images.
es: Lista las referencias de las imágenes locales.
fr: Liste les références des images locales.
ja: ローカルイメージの参照を一覧表示します。
tr: Yerel imajların referanslarını listeler.
zh_hans: 列出本地镜像的引用。

source: Maximum number of recent lines to return.
es: Número máximo de líneas recientes a devolver.
fr: Nombre maximal de lignes récentes à renvoyer.
ja: 返す最新行の最大数。
tr: Döndürülecek en fazla son satır sayısı.
zh_hans: 要返回的最近行数上限。

source: Name
es: Nombre
fr: Nom
ja: 名前
tr: Ad
zh_hans: 名称

source: Optional platform, e.g. linux/arm64.
es: Plataforma opcional, p. ej. linux/arm64.
fr: Plateforme facultative, par ex. linux/arm64.
ja: 任意のプラットフォーム（例：linux/arm64）。
tr: İsteğe bağlı platform, ör. linux/arm64.
zh_hans: 可选平台，例如 linux/arm64。

source: Path to the build-context directory.
es: Ruta al directorio de contexto de compilación.
fr: Chemin du répertoire de contexte de build.
ja: ビルドコンテキストディレクトリへのパス。
tr: Derleme bağlamı dizininin yolu.
zh_hans: 构建上下文目录的路径。

source: Path to the host file to copy.
es: Ruta al archivo local que se va a copiar.
fr: Chemin du fichier hôte à copier.
ja: コピーするホストファイルへのパス。
tr: Kopyalanacak ana bilgisayar dosyasının yolu.
zh_hans: 要复制的主机文件路径。

source: Path to write the .tar archive to.
es: Ruta donde escribir el archivo .tar.
fr: Chemin où écrire l'archive .tar.
ja: .tarアーカイブの書き込み先パス。
tr: .tar arşivinin yazılacağı yol.
zh_hans: 要写入 .tar 归档文件的路径。

source: Platform
es: Plataforma
fr: Plateforme
ja: プラットフォーム
zh_hans: 平台

source: Prunes unused containers, images, and volumes to reclaim disk space.
es: Elimina contenedores, imágenes y volúmenes sin usar para liberar espacio en disco.
fr: Purge les conteneurs, images et volumes inutilisés pour libérer de l'espace disque.
ja: 未使用のコンテナ、イメージ、ボリュームを整理してディスク容量を確保します。
tr: Disk alanını geri kazanmak için kullanılmayan konteynerleri, imajları ve birimleri budar.
zh_hans: 清理未使用的容器、镜像和存储卷以释放磁盘空间。

source: Pull ${reference}
es: Extraer ${reference}
fr: Tirer ${reference}
ja: ${reference} をプル
tr: ${reference} çek
zh_hans: 拉取 ${reference}

source: Pull Image
es: Extraer imagen
fr: Tirer une image
ja: イメージをプル
tr: İmaj Çek
zh_hans: 拉取镜像

source: Pulled %@.
es: %@ extraído.
fr: %@ tiré.
ja: %@をプルしました。
tr: %@ çekildi.
zh_hans: 已拉取 %@。

source: Pulls an image from a registry.
es: Extrae una imagen de un registro.
fr: Tire une image depuis un registre.
ja: レジストリからイメージをプルします。
tr: Bir kayıt defterinden imaj çeker.
zh_hans: 从镜像仓库拉取镜像。

source: Reclaim Space
es: Liberar espacio
fr: Récupérer de l'espace
ja: 空き容量を回収
tr: Alanı Geri Kazan
zh_hans: 释放空间

source: Reclaimed unused space.
es: Espacio sin usar recuperado.
fr: Espace inutilisé récupéré.
ja: 未使用の領域を解放しました。
tr: Kullanılmayan alan geri kazanıldı.
zh_hans: 已回收未使用的空间。

source: Returns a snapshot of a container's recent logs.
es: Devuelve una instantánea de los registros recientes de un contenedor.
fr: Renvoie un instantané des journaux récents d'un conteneur.
ja: コンテナの最新ログのスナップショットを返します。
tr: Bir konteynerin son günlüklerinin anlık görüntüsünü döndürür.
zh_hans: 返回容器最近日志的快照。

source: Run ${image}
es: Ejecutar ${image}
fr: Lancer ${image}
ja: ${image} を実行
tr: ${image} çalıştır
zh_hans: 运行 ${image}

source: Run Container
es: Ejecutar contenedor
fr: Lancer un conteneur
ja: コンテナを実行
tr: Konteyner Çalıştır
zh_hans: 运行容器

source: Runs a detached container from an image.
es: Ejecuta un contenedor en segundo plano a partir de una imagen.
fr: Lance un conteneur détaché à partir d'une image.
ja: イメージからデタッチモードでコンテナを実行します。
tr: Bir imajdan ayrık bir konteyner çalıştırır.
zh_hans: 以分离模式从镜像运行容器。

source: Start Container Services
es: Iniciar servicios de contenedores
fr: Démarrer les services de conteneur
ja: コンテナサービスを開始
tr: Konteyner Hizmetlerini Başlat
zh_hans: 启动容器服务

source: Started container %@.
es: Contenedor %@ iniciado.
fr: Conteneur %@ démarré.
ja: コンテナ%@を開始しました。
tr: %@ konteyneri başlatıldı.
zh_hans: 已启动容器 %@。

source: Started the container services.
es: Se iniciaron los servicios de contenedores.
fr: Services de conteneur démarrés.
ja: コンテナサービスを開始しました。
tr: Konteyner hizmetleri başlatıldı.
zh_hans: 已启动容器服务。

source: Starts Capsule's container system service.
es: Inicia el servicio del sistema de contenedores de Capsule.
fr: Démarre le service système de conteneurs de Capsule.
ja: Capsuleのコンテナシステムサービスを開始します。
tr: Capsule'ın konteyner sistem hizmetini başlatır.
zh_hans: 启动 Capsule 的容器系统服务。

source: Stop Container Services
es: Detener servicios de contenedores
fr: Arrêter les services de conteneur
ja: コンテナサービスを停止
tr: Konteyner Hizmetlerini Durdur
zh_hans: 停止容器服务

source: Stopped the container services.
es: Se detuvieron los servicios de contenedores.
fr: Services de conteneur arrêtés.
ja: コンテナサービスを停止しました。
tr: Konteyner hizmetleri durduruldu.
zh_hans: 已停止容器服务。

source: Stops Capsule's container system service.
es: Detiene el servicio del sistema de contenedores de Capsule.
fr: Arrête le service système de conteneurs de Capsule.
ja: Capsuleのコンテナシステムサービスを停止します。
tr: Capsule'ın konteyner sistem hizmetini durdurur.
zh_hans: 停止 Capsule 的容器系统服务。

source: System
es: Sistema
fr: Système
ja: システム
tr: Sistem
zh_hans: 系统

source: Tag
es: Etiqueta
fr: Étiquette
ja: タグ
tr: Etiket
zh_hans: 标签

source: The container id or name to export.
es: El id o nombre del contenedor que se va a exportar.
fr: L'ID ou le nom du conteneur à exporter.
ja: エクスポートするコンテナのIDまたは名前。
tr: Dışa aktarılacak konteyner kimliği veya adı.
zh_hans: 要导出的容器 ID 或名称。

source: The container id or name.
es: El id o nombre del contenedor.
fr: L'ID ou le nom du conteneur.
ja: コンテナのIDまたは名前。
tr: Konteyner kimliği veya adı.
zh_hans: 容器 ID 或名称。

source: The image reference to pull, e.g. nginx:latest.
es: La referencia de la imagen que se va a extraer, p. ej. nginx:latest.
fr: La référence d'image à tirer, par ex. nginx:latest.
ja: プルするイメージ参照（例：nginx:latest）。
tr: Çekilecek imaj referansı, ör. nginx:latest.
zh_hans: 要拉取的镜像引用，例如 nginx:latest。

source: The image reference to run, e.g. nginx:latest.
es: La referencia de la imagen que se va a ejecutar, p. ej. nginx:latest.
fr: La référence d'image à lancer, par ex. nginx:latest.
ja: 実行するイメージ参照（例：nginx:latest）。
tr: Çalıştırılacak imaj referansı, ör. nginx:latest.
zh_hans: 要运行的镜像引用，例如 nginx:latest。

source: The image tag to apply, e.g. myapp:latest.
es: La etiqueta de imagen que se va a aplicar, p. ej. myapp:latest.
fr: Le tag d'image à appliquer, par ex. myapp:latest.
ja: 適用するイメージタグ（例：myapp:latest）。
tr: Uygulanacak imaj etiketi, ör. myapp:latest.
zh_hans: 要应用的镜像标签，例如 myapp:latest。

source: The target container id or name.
es: El id o nombre del contenedor de destino.
fr: L'ID ou le nom du conteneur cible.
ja: 対象コンテナのIDまたは名前。
tr: Hedef konteyner kimliği veya adı.
zh_hans: 目标容器 ID 或名称。
